FSLART/VCU_STM32_Firmware_V1/Core/Src/main.c
/*
float MeasureBrakePressure(uint16_t bits) {
    // Constants for clarity
    const float ADC_MAX = 4095.0f;
    const float MCU_VREF = 3.3f;             // MCU reference voltage
    const float SENSOR_VREF = 5.0f;          // Sensor reference voltage
    const float CONVERSION_FACTOR = 0.667f;  // Factor to convert 3.3V to 5V scale
    const float OFFSET_VOLTAGE = 0.5f;       // 0 bar = 0.5V
    const float SENSITIVITY = 0.02857f;      // 28.57mV/bar

    // Calculate voltage from ADC reading (0-3.3V range)
    float volts = (float)bits * MCU_VREF / ADC_MAX;

    // Scale to sensor voltage range (0-5V)
    volts = volts / CONVERSION_FACTOR;

    // Apply boundary checking for voltage
    if (volts < 0.0f) {
        volts = 0.0f;
    } else if (volts > SENSOR_VREF) {
        volts = SENSOR_VREF;
    }

    // Calculate pressure from voltage using calibration formula:
    // P(bar) = (V - 0.5V) / 0.02857V/bar
    float pressure = 0.0f;
    if (volts <= OFFSET_VOLTAGE) {
        pressure = 0.0f;  // Anything below offset voltage is 0 bar
    } else {
        pressure = (volts - OFFSET_VOLTAGE) / SENSITIVITY;
    }

    // Limit maximum pressure if needed
    const float MAX_PRESSURE = 250.0f;  // Maximum measurable pressure
    if (pressure > MAX_PRESSURE) {
        pressure = MAX_PRESSURE;
    }

    return pressure;  // Return the brake pressure in bar
}*/

/**
 * @brief Controls the brake light based on brake pressure and regenerative braking
 * @param brake_pressure Current brake pressure in bar
 * @details Turns the brake light on when pressure exceeds minimum threshold
 *          or when regenerative braking is active (negative current from FSIC_t)
 */
void turn_on_brake_light(uint8_t brake_pressure) {
    // Define thresholds for brake light activation (can be adjusted as needed)
    const uint8_t BRAKE_LIGHT_THRESHOLD = 5;     // bar
    const int16_t REGEN_CURRENT_THRESHOLD = -2;  // Negative current threshold for regen braking (A)

    // Check if brake pressure exceeds threshold OR regenerative braking is active
    bool physical_braking = (brake_pressure >= BRAKE_LIGHT_THRESHOLD);
    // SAFETY-CRITICAL: Regen braking detection — sum DC current from both inverters
    int16_t total_dc_current = (int16_t)(myFSIC1.Actual_DCCurrent + myFSIC2.Actual_DCCurrent);
    bool regen_braking = (total_dc_current < REGEN_CURRENT_THRESHOLD);

    if (physical_braking || regen_braking) {
        // Turn brake light on
        HAL_GPIO_WritePin(dout1_BMS_IGN_GPIO_Port, dout1_BMS_IGN_Pin, GPIO_PIN_SET);
    } else {
        // Turn brake light off
        HAL_GPIO_WritePin(dout1_BMS_IGN_GPIO_Port, dout1_BMS_IGN_Pin, GPIO_PIN_RESET);
    }
}

/**
 * @brief Initialize moving average buffers for APPS
 */
void MovingAverage_Init(void) {
    for (int i = 0; i < APPS_MA_WINDOW_SIZE; i++) {
        apps1_buffer[i] = 0;
        apps2_buffer[i] = 0;
    }
    apps_buffer_pos = 0;
    apps1_avg = 0;
    apps2_avg = 0;
}

/**
 * @brief Update moving average with new APPS values
 * @param apps1_raw Raw value from APPS1 sensor
 * @param apps2_raw Raw value from APPS2 sensor
 * @return None, updates apps1_avg and apps2_avg global variables
 */
void MovingAverage_Update(uint16_t apps1_raw, uint16_t apps2_raw) {
    // Add new values to buffers
    apps1_buffer[apps_buffer_pos] = apps1_raw;
    apps2_buffer[apps_buffer_pos] = apps2_raw;

    // Update position for next entry
    apps_buffer_pos = (apps_buffer_pos + 1) % APPS_MA_WINDOW_SIZE;

    // Calculate averages
    uint32_t sum1 = 0;
    uint32_t sum2 = 0;

    for (int i = 0; i < APPS_MA_WINDOW_SIZE; i++) {
        sum1 += apps1_buffer[i];
        sum2 += apps2_buffer[i];
    }

    apps1_avg = (uint16_t)(sum1 / APPS_MA_WINDOW_SIZE);
    apps2_avg = (uint16_t)(sum2 / APPS_MA_WINDOW_SIZE);
}

/* -------------------- LED CONTROL FUNCTIONS -------------------- */
/**
 * @brief Heartbeat indicator with non-blocking double blink pattern
 * @param GPIO_Port GPIO port of the LED
 * @param GPIO_Pin GPIO pin of the LED
 */
void heartbeat_nonblocking(GPIO_TypeDef* GPIO_Port, uint16_t GPIO_Pin) {
    static uint32_t previous_tick = 0;
    static uint8_t state = 0;

    uint32_t current_tick = HAL_GetTick();

    // State transitions based on timing
    switch (state) {
        case 0:  // First blink ON
            HAL_GPIO_WritePin(GPIO_Port, GPIO_Pin, GPIO_PIN_SET);
            if (current_tick - previous_tick >= 100) {  // 100ms ON
                previous_tick = current_tick;
                state = 1;
            }
            break;

        case 1:  // First blink OFF
            HAL_GPIO_WritePin(GPIO_Port, GPIO_Pin, GPIO_PIN_RESET);
            if (current_tick - previous_tick >= 100) {  // 100ms OFF
                previous_tick = current_tick;
                state = 2;
            }
            break;

        case 2:  // Second blink ON
            HAL_GPIO_WritePin(GPIO_Port, GPIO_Pin, GPIO_PIN_SET);
            if (current_tick - previous_tick >= 100) {  // 100ms ON
                previous_tick = current_tick;
                state = 3;
            }
            break;

        case 3:  // Second blink OFF
            HAL_GPIO_WritePin(GPIO_Port, GPIO_Pin, GPIO_PIN_RESET);
            if (current_tick - previous_tick >= 100) {  // 100ms OFF
                previous_tick = current_tick;
                state = 4;
            }
            break;

        case 4:                                         // Long pause
            if (current_tick - previous_tick >= 500) {  // 500ms pause
                previous_tick = current_tick;
                state = 0;  // Restart cycle
            }
            break;
    }
}

/**
 * @brief LED startup animation
 * @note  This function performs a startup animation for the LEDs.
 */
void startup_leds_animation(void) {
    // LED startup animation
    HAL_GPIO_WritePin(GPIOD, LED_IGN_Pin, GPIO_PIN_SET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_R2D_Pin, GPIO_PIN_SET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_AUTO_Pin, GPIO_PIN_SET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_PWT_Pin, GPIO_PIN_SET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOB, LED_DATA_Pin, GPIO_PIN_SET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOB, LED_Heartbeat_Pin, GPIO_PIN_SET);
    HAL_Delay(350);
    HAL_GPIO_WritePin(GPIOB, LED_Heartbeat_Pin, GPIO_PIN_RESET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOB, LED_DATA_Pin, GPIO_PIN_RESET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_PWT_Pin, GPIO_PIN_RESET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_AUTO_Pin, GPIO_PIN_RESET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_R2D_Pin, GPIO_PIN_RESET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_IGN_Pin, GPIO_PIN_RESET);
    HAL_Delay(40);

    // Turn off all LEDs
    HAL_GPIO_WritePin(GPIOD, LED_IGN_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(GPIOD, LED_R2D_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(GPIOD, LED_AUTO_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(GPIOD, LED_PWT_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(GPIOB, LED_DATA_Pin, GPIO_PIN_RESET);
}

/**
 * @brief Fade LED in and out using software PWM
 * @param GPIO_Port GPIO port of the LED
 * @param GPIO_Pin GPIO pin of the LED
 */
void led_fade_nonblocking(GPIO_TypeDef* GPIO_Port, uint16_t GPIO_Pin) {
    static uint32_t last_update_time = 0;
    static uint32_t fade_counter = 0;
    static uint32_t pwm_counter = 0;
    static const uint32_t PWM_PERIOD = 5;    // PWM period for software PWM
    static const uint32_t FADE_PERIOD = 50;  // How fast the LED brightness changes

    uint32_t current_time = HAL_GetTick();

    // Update fade counter (determines brightness level)
    if (current_time - last_update_time >= FADE_PERIOD) {
        fade_counter = (fade_counter + 1) % 200;  // 0-199 range for smooth transition
        last_update_time = current_time;
        pwm_counter = 0;  // Reset PWM counter on brightness change
    }

    // Calculate current brightness level (0-100)
    uint32_t brightness;
    if (fade_counter < 100) {
        brightness = fade_counter;  // Fade in (0-99)
    } else {
        brightness = 200 - fade_counter;  // Fade out (99-0)
    }

    // Implement software PWM
    pwm_counter = (pwm_counter + 2) % PWM_PERIOD;

    if (pwm_counter < brightness) {
        HAL_GPIO_WritePin(GPIO_Port, GPIO_Pin, GPIO_PIN_SET);  // Turn LED on
    } else {
        HAL_GPIO_WritePin(GPIO_Port, GPIO_Pin, GPIO_PIN_RESET);  // Turn LED off
    }
}

/**
 * @brief Update PWM value for LED fading effect using hardware timer
 * @param htim PWM timer handle
 * @param channel Timer channel to update
 */
void led_fade_pwm(TIM_HandleTypeDef* htim, uint32_t channel) {
    static uint32_t last_update_time = 0;
    static uint16_t brightness = 0;
    static int8_t direction = 1;                  // 1 = increasing, -1 = decreasing
    static const uint32_t FADE_PERIOD = 1;        // Update interval in ms
    static const uint16_t MAX_BRIGHTNESS = 1000;  // Maximum PWM value

    uint32_t current_time = HAL_GetTick();

    // Update PWM value at regular intervals
    if (current_time - last_update_time >= FADE_PERIOD) {
        last_update_time = current_time;

        // Update brightness based on current direction
        brightness += direction;

        // Change direction at limits
        if (brightness >= MAX_BRIGHTNESS) {
            direction = -1;  // Start decreasing
        } else if (brightness <= 0) {
            direction = 1;  // Start increasing
        }

        // Apply new PWM value (constraining to valid range)
        if (brightness > MAX_BRIGHTNESS) brightness = MAX_BRIGHTNESS;
        if (brightness < 0) brightness = 0;

        __HAL_TIM_SET_COMPARE(htim, channel, brightness);
    }
}

/* -------------------- R2D SOUND FUNCTIONS -------------------- */
/**
 * @brief Start playing the Ready-To-Drive sound
 * @details This function activates the buzzer to play the R2D sound
 *          as required by EV4.12 regulations (80-90 dBA, 1-3 seconds).
 */
void StartR2DSound(void) {
    // Activate only if not already playing
    if (!vcu.r2d_sound_playing && !vcu.r2d_sound_completed) {
        vcu.r2d_sound_playing = true;
        vcu.r2d_sound_start_time = HAL_GetTick();

