FSLART/VCU_STM32_Firmware_V1/Core/Src/main.c
    can_send_vcu_ign_r2d_signals(&hcan3,
                                 vcu.ignition_switch_signal,                 // manual ignition
                                 (current_state == STATE_READY_MANUAL),      // manual R2D
                                 vcu.ignition_ad,                            // auto ignition
                                 (current_state == STATE_READY_AUTONOMOUS),  // auto R2D
                                 vcu.shutdown_signal,                        // shutdown signal
                                 (uint8_t)current_state);                    // VCU state

    // Send VCU telemetry frames in rotation (one different frame each time)
    static uint8_t frame_index = 0;

    switch (frame_index) {
        case 0:
            send_vcu_0(&hcan1, (const FSIC_t*)&myFSIC1);
            send_vcu_3(&hcan1, vcu.r2d_toggle_signal, vcu.ignition_switch_signal, vcu.r2d_autonomous_signal,
                       vcu.ignition_ad, (const FSIC_t*)&myFSIC1);

            break;
        case 1:
            send_vcu_1(&hcan1, (const FSIC_t*)&myFSIC1, (const BMSvars_t*)&bms);
            can_bus_send_brake_pressure(&hcan1, vcu.brake_pressure);
            break;
        case 2:
            send_vcu_2(&hcan1, (const FSIC_t*)&myFSIC1);
            break;
        case 3:
            send_vcu_3(&hcan1, vcu.r2d_toggle_signal, vcu.ignition_switch_signal, vcu.r2d_autonomous_signal,
                       vcu.ignition_ad, (const FSIC_t*)&myFSIC1);
            break;
        case 4:
            send_vcu_4(&hcan1, (const ACU_t*)&acu);
            break;
    }

    // Move to next frame for next execution (cycles through 0-4)
    frame_index = (frame_index + 1) % 5;
}

void process_can_rx_queues(void) {
    can_msg_t msg;

    /* CAN1 — Data bus */
    while (can_queue_pop(&can1_rx_queue, &msg)) {
        // Future: decode data bus messages
        (void)msg;
    }

    /* CAN2 — Powertrain */
    while (can_queue_pop(&can2_rx_queue, &msg)) {
        decode_powertrain_bus(&msg, (BMSvars_t*)&bms, (FSIC_t*)&myFSIC1, (FSIC_t*)&myFSIC2, (IVT_t*)&ivt);
    }

    /* CAN3 — Autonomous */
    while (can_queue_pop(&can3_rx_queue, &msg)) {
        decode_autonomous_bus(&msg, (AS_System_t*)&as_system, (ACU_t*)&acu, (RES_t*)&res);
    }
}

/**
 * @brief Execute immediate tasks (every loop iteration)
 * @details Tasks that need to run as fast as possible
 */
void execute_immediate_tasks(void) {
    // Heartbeat LED indicator
    heartbeat_nonblocking(GPIOB, LED_Heartbeat_Pin);

    // Update state machine
    UpdateState();

    // Execute state-specific actions
    HandleState();
}

/* -------------------- COMMUNICATION FUNCTIONS -------------------- */

/**
 * @brief Redirect printf to UART
 */
PUTCHAR_PROTOTYPE {
    /* Place your implementation of fputc here */
    /* e.g. write a character to the USART1 and Loop until the end of transmission */
    HAL_UART_Transmit(&huart3, (uint8_t*)&ch, 1, 0xFFFF);

    return ch;
}

void HAL_CAN_RxFifo0MsgPendingCallback(CAN_HandleTypeDef* hcan) {
    can_driver_rx_isr(hcan);
}

#pragma region MAIN
/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {
    /* USER CODE BEGIN 1 */
    current_state = STATE_INIT;
    /* USER CODE END 1 */

    /* MPU Configuration--------------------------------------------------------*/
    MPU_Config();

    /* Enable the CPU Cache */

    /* Enable I-Cache---------------------------------------------------------*/
    SCB_EnableICache();

    /* Enable D-Cache---------------------------------------------------------*/
    SCB_EnableDCache();

    /* MCU Configuration--------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* USER CODE BEGIN Init */

    // HAL_ADC_Start_DMA(&hadc3, (uint32_t *)&adc_buffer, 5);

    // HAL_ADC_Start(&hadc3);

    /* USER CODE END Init */

    /* Configure the system clock */
    SystemClock_Config();

    /* USER CODE BEGIN SysInit */

    /* USER CODE END SysInit */

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_DMA_Init();
    MX_USART1_UART_Init();
    MX_ADC1_Init();
    MX_CAN3_Init();
    MX_CAN1_Init();
    MX_CAN2_Init();
    MX_TIM1_Init();
    MX_TIM4_Init();
    MX_USART3_UART_Init();
    MX_TIM2_Init();
    /* USER CODE BEGIN 2 */
    APPS_Init(__APPS_MIN_BITS, __APPS_MAX_BITS, __APPS_TOLERANCE);  // Initialize APPS
    HAL_TIM_Base_Start_IT(&htim2);

    can_driver_init();

    startup_leds_animation();
    MovingAverage_Init();  // Initialize moving average buffers

    HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1);
    //__HAL_TIM_SET_COMPARE(&htim4, TIM_CHANNEL_1, 2000);

    /* USER CODE END 2 */

    /* Infinite loop */
    /* USER CODE BEGIN WHILE */


    HAL_ADC_Start_DMA(&hadc1, (uint32_t*)ADC1_VAL, 4);
    // HAL_ADC_Start_DMA(&hadc2, ADC2_APPS, 2);  // Start ADC2 for APPS
    //  Calibrate APPS

    bspd_init(&bspd_state);
    res.signal = RES_SIGNAl_DEFAULT_1;  // start with a value different than 0 to avoid emergency state
    DBG_PRINTF("\n\n\n\n\n======================== RESET ========================\n\n\n\n\n\r");

#if CALIBRATE_APPS
    APPS_StartCalibration();
#endif

    while (1) {
        /* USER CODE END WHILE */

        /* USER CODE BEGIN 3 */

        // Drain TX queues to hardware
        can_driver_tx_poll();

        // Process RX queues (decode in main context, not ISR)
        process_can_rx_queues();

        // Execute immediate tasks every loop iteration
        execute_immediate_tasks();

        // Timing-based tasks
        static uint32_t previous_tick_10ms = 0;
        static uint32_t previous_tick_100ms = 0;
        uint32_t current_tick = HAL_GetTick();

        // 10ms tasks (100Hz) - High frequency control tasks
        if (current_tick - previous_tick_10ms >= 10) {
            execute_10ms_tasks();
            previous_tick_10ms = current_tick;
        }

        // 100ms tasks (10Hz) - Medium frequency monitoring tasks
        if (current_tick - previous_tick_100ms >= 100) {
            execute_100ms_tasks();
            previous_tick_100ms = current_tick;
        }
    }
    /* USER CODE END 3 */
}

/**
 * @brief System Clock Configuration
 * @retval None
 */
void SystemClock_Config(void) {
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

